# GetInstanceTransform Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
FaceDetailNode..::..GetInstanceTransform Method
FaceDetailNode Class See Also
---
Returns instance transform of the object being drawn.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2020
# Syntax
C#
---
```text
public Transform GetInstanceTransform()
```

Visual Basic
---
```text
Public Function GetInstanceTransform As Transform
```

Visual C++
---
```text
public:
Transform^ GetInstanceTransform()
```

# See Also
FaceDetailNode Class
Autodesk.Revit.DB Namespace